Revit 2027 API
WaterLoopData.WaterLoopType Property
 The type of water loop. Note this property change would reset other properties.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public WaterLoopType WaterLoopType { get; set; }
Public Property WaterLoopType As WaterLoopType
	Get
	Set
public:
property WaterLoopType WaterLoopType {
	WaterLoopType get ();
	void set (WaterLoopType value);
}
member WaterLoopType : WaterLoopType with get, set
Property Value
WaterLoopType
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
WaterLoopData Class
Autodesk.Revit.DB.Mechanical Namespace